tutorialsDyM/2DOscillatoryDisk/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    ( -1  0.0  0)
    ( 2.  0.0  0)
    ( 2.  1.0  0)
    ( -1  1.0  0)
    ( -1  0.0  1)
    ( 2.  0.0  1)
    ( 2.  1.0  1)
    ( -1  1.0  1)

    ( 0.2  0.4  0)
    ( 0.8  0.4  0)
    (  0.8  0.6  0)
    ( 0.2  0.6  0)
    ( 0.2  0.4  1)
    ( 0.8  0.4  1)
    (  0.8  0.6  1)
    ( 0.2  0.6  1)
);

blocks
(


    hex (0 1 2 3 4 5 6 7) (300 100 1) simpleGrading (1 1 1)

    hex (8 9 10 11 12 13 14 15) movingZone (60 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    overset2
    {
        type        overset;
        faces
        (
            ( 8 12 15 11)
            (10 14 13  9)
            (11 15 14 10)
            ( 9 13 12  8)
        );
    }


    // Populated by subsetMesh
    hole
    {
        type wall;
        faces ();
    }


    outlet
    {
		        type wall;

   //  type   cyclic;
   //  neighbourPatch inlet;
        faces
        (
            (1 2 6 5)
        );
    }
    
    inlet
    {
		        type wall;

//type   cyclic;
   //  neighbourPatch outlet;
             faces
        (
            (3 0 4 7)
        );
    }
    
    top
    {
        type wall;
        faces
        (
//            (3 7 6 2)
            (3 7 6 2)
        );
    }
    bottom
    {
        type wall;
        faces
        (
//            (3 7 6 2)
            (0 1 5 4)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            ( 8 11 10  9)
            (12 13 14 15)
        );
    }
);

// ************************************************************************* //
